# Pandas

## Series

In [4]:
import pandas as pd

In [7]:
my_series = pd.Series([1.0, 1, 4, 7, 8, 3, 5])

In [8]:
my_series

0    1.0
1    1.0
2    4.0
3    7.0
4    8.0
5    3.0
6    5.0
dtype: float64

In [9]:
my_series[1]

1.0

In [11]:
my_series[::2]

0    1.0
2    4.0
4    8.0
6    5.0
dtype: float64

In [13]:
my_series[my_series > 4]

3    7.0
4    8.0
6    5.0
dtype: float64

In [14]:
my_series * 2

0     2.0
1     2.0
2     8.0
3    14.0
4    16.0
5     6.0
6    10.0
dtype: float64

can use any math operation from numpy

In [15]:
import numpy as np

In [16]:
np.sum(my_series)

29.0

In [17]:
np.exp(my_series)

0       2.718282
1       2.718282
2      54.598150
3    1096.633158
4    2980.957987
5      20.085537
6     148.413159
dtype: float64

## DataFrame

looks like regular table - it has rows and colums. Every row has index and every column has name

In [22]:
df = pd.DataFrame({
    'name': ['Masha', 'Vasia', 'Petya'],
    'age': [25, 8, 10],
    'job': ['Programmer', 'Schoolboy', 'Scout'],
    'salary': [200, 10, 15]
})

In [23]:
df

    name  age         job  salary
0  Masha   25  Programmer     200
1  Vasia    8   Schoolboy      10
2  Petya   10       Scout      15

In [26]:
name = df['name']

In [27]:
name

0    Masha
1    Vasia
2    Petya
Name: name, dtype: object

In [28]:
df[df['salary']>100]

    name  age         job  salary
0  Masha   25  Programmer     200

In [29]:
df['salary'] *= 10

In [30]:
df

    name  age         job  salary
0  Masha   25  Programmer    2000
1  Vasia    8   Schoolboy     100
2  Petya   10       Scout     150

In [33]:
df['salary'] / 2

0    1000.0
1      50.0
2      75.0
Name: salary, dtype: float64

In [38]:
df

         name  age         job  salary
some    Masha   25  Programmer     200
random  Vasia    8   Schoolboy      10
words   Petya   10       Scout      15

In [35]:
df = pd.DataFrame({
    'name': ['Masha', 'Vasia', 'Petya'],
    'age': [25, 8, 10],
    'job': ['Programmer', 'Schoolboy', 'Scout'],
    'salary': [200, 10, 15]
}, index=['some', 'random', 'words'])

In [36]:
df

         name  age         job  salary
some    Masha   25  Programmer     200
random  Vasia    8   Schoolboy      10
words   Petya   10       Scout      15

In [40]:
df.loc['some':'words']

         name  age         job  salary
some    Masha   25  Programmer     200
random  Vasia    8   Schoolboy      10
words   Petya   10       Scout      15

In [47]:
vasia = df.iloc[1]
print(vasia, '*'*20, type(vasia), sep='\n')

name          Vasia
age               8
job       Schoolboy
salary           10
Name: random, dtype: object
********************
<class 'pandas.core.series.Series'>

In [52]:
df.iloc[:2]

         name  age         job  salary
some    Masha   25  Programmer     200
random  Vasia    8   Schoolboy      10

In [53]:
df.T

              some     random  words
name         Masha      Vasia  Petya
age             25          8     10
job     Programmer  Schoolboy  Scout
salary         200         10     15

In [57]:
!dir

 Volume in drive C has no label.
 Volume Serial Number is 5AB0-BEDC

 Directory of C:\Users\o84083853\LearnPython\LP_task_solving\data_track

25.11.2018  11:42    <DIR>          .
25.11.2018  11:42    <DIR>          ..
23.11.2018  19:44    <DIR>          .ipynb_checkpoints
22.11.2018  15:14         3я492я172 bus_stops.csv
25.11.2018  11:42            23я786 data_lesson2.ipynb
23.11.2018  18:15    <DIR>          env
23.11.2018  19:36           117я162 lesson1.ipynb
23.11.2018  19:36                72 Untitled1.ipynb
               4 File(s)      3я633я192 bytes
               4 Dir(s)   8я081я965я056 bytes free